ezois_ka/oooezoiskaobmen/src/Documents/ИзмененияСведенийСотрудниковДляВоенкомата/ИзмененияСведенийСотрудниковДляВоенкомата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзмененияСведенийСотрудниковДляВоенкомата</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоВВоенкомат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВУР</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственногоЗаВУР</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдресОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОтчетности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Военкомат</name>
      <type>
        <types>CatalogRef.Военкоматы</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтраховойНомерСФР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПаспорта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаспорта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачиПаспорта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИзменений</name>
      <type>
        <types>EnumRef.ВидИзмененийСведенийСотрудниковДляВоенкомата</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеИзменений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистокСообщения</name>
      <type>
        <types>DocumentRef.ЛистокСообщенияДляВоенкомата</types>
      </type>
    </attributes>
    <attributes>
      <name>Звание</name>
      <type>
        <types>CatalogRef.ЗванияГражданскогоВоинскогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКомандыПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Забронирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/ЛистокСообщенияДляВоенкомата/ЛистокСообщенияДляВоенкомата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистокСообщенияДляВоенкомата</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЛистковСообщения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВрученияСотруднику</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевручения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>СемейноеПоложение</name>
    <type>
      <types>CatalogRef.СостояниеВБраке</types>
    </type>
  </attributes>
  <attributes>
    <name>Звание</name>
    <type>
      <types>CatalogRef.ЗванияГражданскогоВоинскогоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗдоровья</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаПроживанияПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставСемьи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВУР</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИзменений</name>
    <type>
      <types>EnumRef.ВидИзмененийСведенийСотрудниковДляВоенкомата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/ИзмененияСведенийСотрудниковДляВоенкомата/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Сотрудники.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ВоинскийУчет.ДляОтбораПоОрганизации(Настройки);
	ВоинскийУчет.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ИзмененияСведенийСотрудниковДляВоенкомата;
	ОписаниеСоставаОбъекта = ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	ОписаниеСоставаОбъекта.ЗаполнятьФизическиеЛицаПоСотрудникам = Ложь;
	Возврат ОписаниеСоставаОбъекта;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "ПФ_MXL_СведенияОбИзмененияхДляВоенкомата";
	КомандаПечати.Представление = НСтр("ru = 'Сведения об изменениях для военкомата'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СведенияОбИзмененияхДляВоенкомата") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПФ_MXL_СведенияОбИзмененияхДляВоенкомата", 
			НСтр("ru = 'Сведения об изменениях для военкомата'"), 
			ПечатнаяФормаСведенияОбИзмененияхДляВоенкомата(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;					
						
КонецПроцедуры								

Функция ПечатнаяФормаСведенияОбИзмененияхДляВоенкомата(МассивОбъектов, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИзмененияСведенийСотрудниковДляВоенкомата";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ВыборкаПоШапкеДокумента = ЗапросПоШапкеДляПечати(МассивОбъектов).Выбрать();
	ВыборкаПоРаботникам = ЗапросПоСотрудникамДляПечати(МассивОбъектов).Выбрать();
	
	Пока ВыборкаПоШапкеДокумента.СледующийПоЗначениюПоля("Ссылка") Цикл 
		
		Макет 		  = УправлениеПечатью.МакетПечатнойФормы("Отчет.СведенияОбИзмененияхДляВоенкомата.ПФ_MXL_СведенияОбИзмененияхДляВоенкомата");
		Заголовок 	  = Макет.ПолучитьОбласть("Заголовок");
		Шапка 		  = Макет.ПолучитьОбласть("Шапка");
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Подвал 		  = Макет.ПолучитьОбласть("Подвал");
		
		ВыборкаПоРаботникам.Сбросить();
		
		Если ВыборкаПоРаботникам.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоШапкеДокумента.Ссылка)) Тогда
			
			ВыборкаПоРаботникам.СледующийПоЗначениюПоля("Ссылка");
			
			Пока ВыборкаПоРаботникам.СледующийПоЗначениюПоля("Военкомат") Цикл 
		
				НачалоФормы = ДокументРезультат.ВысотаТаблицы + 1;
				
				ЗаполнитьЗначенияСвойств(Заголовок.Параметры, ВыборкаПоРаботникам);
				ЗаполнитьЗначенияСвойств(Заголовок.Параметры, ВыборкаПоШапкеДокумента);
				
				ДокументРезультат.Вывести(Заголовок);
				ДокументРезультат.Вывести(Шапка);
				
				НомерСтроки = 1;
				
				Пока ВыборкаПоРаботникам.Следующий() Цикл
					
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы.Параметры, ВыборкаПоРаботникам);
					СтрокаТаблицы.Параметры.ФИОПолные = ВыборкаПоРаботникам.Фамилия + " " + ВыборкаПоРаботникам.Имя + " " + ВыборкаПоРаботникам.Отчество;
					СтрокаТаблицы.Параметры.СистемныеПоляНомерПоПорядкуВГруппировке = НомерСтроки;
					
					Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, СтрокаТаблицы) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ДокументРезультат.Вывести(СтрокаТаблицы);
					НомерСтроки = НомерСтроки + 1;
					
				КонецЦикла;
			
				Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, Подвал) Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Подвал.Параметры, ВыборкаПоШапкеДокумента);
				ДокументРезультат.Вывести(Подвал);
				
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НачалоФормы, ОбъектыПечати, ВыборкаПоШапкеДокумента.Ссылка);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция ЗапросПоШапкеДляПечати(МассивСсылок)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзмененияСведенийСотрудниковДляВоенкомата.Дата КАК Дата,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.Номер КАК Номер,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.НомерПриказа КАК НомерПриказа,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.Организация КАК Организация,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.ФактическийАдресОрганизации КАК ФактическийАдресОрганизации,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.Ссылка КАК Ссылка,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.Руководитель КАК Руководитель,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.ОтветственныйЗаВУР КАК ОтветственныйЗаВУР,
		|	ИзмененияСведенийСотрудниковДляВоенкомата.ДолжностьОтветственногоЗаВУР КАК ДолжностьОтветственногоЗаВУР
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.ИзмененияСведенийСотрудниковДляВоенкомата КАК ИзмененияСведенийСотрудниковДляВоенкомата
		|ГДЕ
		|	ИзмененияСведенийСотрудниковДляВоенкомата.Ссылка В(&МассивСсылок)";
	
	Запрос.Выполнить();
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("Руководитель");
	ИменаПолейОтветственныхЛиц.Добавить("ОтветственныйЗаВУР");
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументов");
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокументов.ОтветственныйЗаВУР КАК ОтветственныйЗаВУР
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов";
	
	МассивФизическихЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОтветственныйЗаВУР");
	
	РабочиеТелефоныПодписантов = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(
		МассивФизическихЛиц, , Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
		
	РабочиеТелефоны = Новый ТаблицаЗначений;
	РабочиеТелефоны.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РабочиеТелефоны.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20)));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РабочиеТелефоныПодписантов, РабочиеТелефоны);
	
	Запрос.УстановитьПараметр("РабочиеТелефоны", РабочиеТелефоны);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеТелефоны.Объект КАК ОтветственныйЗаВУР,
		|	РабочиеТелефоны.Представление КАК Телефон
		|ПОМЕСТИТЬ ВТРабочиеТелефоны
		|ИЗ
		|	&РабочиеТелефоны КАК РабочиеТелефоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.Дата КАК Дата,
		|	ДанныеДокументов.Номер КАК Номер,
		|	ДанныеДокументов.НомерПриказа КАК НомерПриказа,
		|	ДанныеДокументов.Организация КАК Организация,
		|	ДанныеДокументов.ФактическийАдресОрганизации КАК ФактАдресОрганизации,
		|	ДанныеДокументов.Руководитель КАК Руководитель,
		|	ДанныеДокументов.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ДанныеДокументов.ОтветственныйЗаВУР КАК ОтветственныйЗаВУР,
		|	ДанныеДокументов.ДолжностьОтветственногоЗаВУР КАК ДолжностьОтветственногоЗаВУР,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(Организации.НаименованиеПолное, 1, 10) <> """"
		|			ТОГДА Организации.НаименованиеПолное
		|		ИНАЧЕ Организации.Наименование
		|	КОНЕЦ КАК ПолноеНаименованиеОрганизации,
		|	Организации.НаименованиеПолное КАК НаименованиеПолное,
		|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
		|	ФИОРуководителя.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи,
		|	ФИООтветственногоЗаВУР.РасшифровкаПодписи КАК ОтветственныйЗаВУРРасшифровкаПодписи,
		|	РабочиеТелефоны.Телефон КАК ТелефонОтветственногоЗаВУР
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ДанныеДокументов.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
		|		ПО ДанныеДокументов.Руководитель = ФИОРуководителя.ФизическоеЛицо
		|			И ДанныеДокументов.Ссылка = ФИОРуководителя.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИООтветственногоЗаВУР
		|		ПО ДанныеДокументов.ОтветственныйЗаВУР = ФИООтветственногоЗаВУР.ФизическоеЛицо
		|			И ДанныеДокументов.Ссылка = ФИООтветственногоЗаВУР.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеТелефоны КАК РабочиеТелефоны
		|		ПО ДанныеДокументов.ОтветственныйЗаВУР = РабочиеТелефоны.ОтветственныйЗаВУР
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокументов.Дата,
		|	Ссылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗапросПоСотрудникамДляПечати(МассивСсылок)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.НомерСтроки КАК НомерСтроки,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Военкомат КАК Военкомат,
		|	Сотрудники.Военкомат.Наименование КАК НаименованиеВоенкомата,
		|	ВЫБОР
		|		КОГДА Сотрудники.Военкомат.НаименованиеДляЭлектронногоОбмена = """"
		|			ТОГДА Сотрудники.Военкомат.Наименование
		|		ИНАЧЕ Сотрудники.Военкомат.НаименованиеДляЭлектронногоОбмена
		|	КОНЕЦ КАК ВоенкоматНаименованиеДляЭлектронногоОбмена,
		|	Сотрудники.Военкомат.Адрес КАК АдресВоенкомата,
		|	Сотрудники.Фамилия КАК Фамилия,
		|	Сотрудники.Имя КАК Имя,
		|	Сотрудники.Отчество КАК Отчество,
		|	Сотрудники.СтраховойНомерСФР КАК СтраховойНомерСФР,
		|	Сотрудники.ДатаРождения КАК ДатаРождения,
		|	Сотрудники.Пол КАК Пол,
		|	Сотрудники.СерияПаспорта КАК СерияПаспорта,
		|	Сотрудники.НомерПаспорта КАК НомерПаспорта,
		|	Сотрудники.ДатаВыдачиПаспорта КАК ДатаВыдачиПаспорта,
		|	Сотрудники.ВидИзменений КАК ВидИзменений,
		|	Сотрудники.СодержаниеИзменений КАК СодержаниеИзменений,
		|	Сотрудники.ЛистокСообщения КАК ЛистокСообщения,
		|	Сотрудники.Звание КАК Звание,
		|	Сотрудники.НомерКомандыПартии КАК НомерКомандыПартии,
		|	Сотрудники.Забронирован КАК Забронирован,
		|	ВЫБОР
		|		КОГДА НЕ Сотрудники.Забронирован
		|			ТОГДА ""общий"" + ВЫБОР
		|					КОГДА Сотрудники.НомерКомандыПартии <> """"
		|						ТОГДА "" ("" + Сотрудники.НомерКомандыПартии + "")""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ ""спец. учет""
		|	КОНЕЦ КАК ВидВоинскогоУчета,
		|	ВЫБОР
		|		КОГДА Сотрудники.ЛистокСообщения = ЗНАЧЕНИЕ(Документ.ЛистокСообщенияДляВоенкомата.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Сотрудники.ЛистокСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЛистковСообщения.НеВрученСотруднику)
		|					ТОГДА Сотрудники.ЛистокСообщения.ПричинаНевручения
		|				ИНАЧЕ Сотрудники.ЛистокСообщения.ДатаВрученияСотруднику
		|			КОНЕЦ
		|	КОНЕЦ КАК Примечание
		|ИЗ
		|	Документ.ИзмененияСведенийСотрудниковДляВоенкомата.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&МассивСсылок)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	Военкомат,
		|	НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗапрашиваемыеКадровыеДанныеСотрудников() Экспорт

	ЗапрашиваемыеДанные = "Фамилия, Имя, Отчество, СтраховойНомерПФР, Пол, ДатаРождения, 
		|ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ВоинскийУчетВоенкомат,
		|ВоинскийУчетЗвание, ВоинскийУчетЗабронированОрганизацией, ВоинскийУчетНомерКомандыПартии";
	
	Возврат ЗапрашиваемыеДанные;
	
КонецФункции

Функция КадровыеДанныеСотрудников(ДанныеСотрудников) Экспорт
	
	ЗапрашиваемыеДанные = ЗапрашиваемыеКадровыеДанныеСотрудников();
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудниковПоТаблицеЗначений(Истина, ДанныеСотрудников, ЗапрашиваемыеДанные);
	
	Возврат КадровыеДанные;
	
КонецФункции

Процедура ЗаполнитьДанныеСтрокиСотрудника(СтрокаСотрудника, КадровыеДанные, ДатаДокумента) Экспорт 
	
	ЗаполнитьЗначенияСвойств(СтрокаСотрудника, КадровыеДанные);
	
	СтрокаСотрудника.Военкомат = КадровыеДанные.ВоинскийУчетВоенкомат; 
	СтрокаСотрудника.СтраховойНомерСФР = КадровыеДанные.СтраховойНомерПФР;
	СтрокаСотрудника.СерияПаспорта = СтрЗаменить(КадровыеДанные.ДокументСерия, " ", "");
	СтрокаСотрудника.НомерПаспорта = СтрЗаменить(КадровыеДанные.ДокументНомер, " ", "");
	СтрокаСотрудника.ДатаВыдачиПаспорта = КадровыеДанные.ДокументДатаВыдачи;
	СтрокаСотрудника.Звание = КадровыеДанные.ВоинскийУчетЗвание;
	СтрокаСотрудника.НомерКомандыПартии = КадровыеДанные.ВоинскийУчетНомерКомандыПартии;
	СтрокаСотрудника.Забронирован = ЗначениеЗаполнено(КадровыеДанные.ВоинскийУчетЗабронированОрганизацией);
	
КонецПроцедуры

Процедура ОбработкаФормированияФайла(Объект) Экспорт
	
	ТекстФайла = СформироватьВыходнойФайл(Объект.Ссылка);
	ВоинскийУчет.ЗаписатьФайлОтчетности(Объект.Ссылка, Объект.ИмяФайлаОтчетности, ТекстФайла, "UTF-8");
	
КонецПроцедуры

Функция СформироватьВыходнойФайл(Ссылка)
	
	СписокДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка);
	ВыборкаПоРаботникам = ЗапросПоСотрудникамДляПечати(СписокДокументов).Выбрать();
	
	ТекстФайла = "Наименование военного комиссариата;Фамилия;Имя;Отчество (при наличии);Дата рождения;Пол;Серия паспорта;Номер паспорта;Дата выдачи паспорта;СНИЛС;Вид изменений;Содержание изменений" + Символы.ПС;
	
	Пока ВыборкаПоРаботникам.Следующий() Цикл 
		ДанныеСтроки = Новый Массив;
		ДанныеСтроки.Добавить(ВыборкаПоРаботникам.ВоенкоматНаименованиеДляЭлектронногоОбмена);
		ДанныеСтроки.Добавить(ВыборкаПоРаботникам.Фамилия);
		ДанныеСтроки.Добавить(ВыборкаПоРаботникам.Имя);
		ДанныеСтроки.Добавить(ВыборкаПоРаботникам.Отчество);
		ДанныеСтроки.Добавить(Формат(ВыборкаПоРаботникам.ДатаРождения, "ДЛФ=Д"));
		ДанныеСтроки.Добавить(Строка(ВыборкаПоРаботникам.Пол));
		ДанныеСтроки.Добавить(ВыборкаПоРаботникам.СерияПаспорта);
		ДанныеСтроки.Добавить(ВыборкаПоРаботникам.НомерПаспорта);
		ДанныеСтроки.Добавить(Формат(ВыборкаПоРаботникам.ДатаВыдачиПаспорта, "ДЛФ=Д"));
		ДанныеСтроки.Добавить(ВыборкаПоРаботникам.СтраховойНомерСФР);
		ДанныеСтроки.Добавить(Строка(ВыборкаПоРаботникам.ВидИзменений)); 
		ДанныеСтроки.Добавить(ВыборкаПоРаботникам.СодержаниеИзменений);
		ТекстФайла = ТекстФайла + СтрСоединить(ДанныеСтроки, ";") + Символы.ПС;
	КонецЦикла;
	
	Возврат ТекстФайла;
		
КонецФункции

#КонецОбласти

#КонецЕсли
